#include "D_TJ3.h"
#include "D_I2C.h"
#include "D_SIO.h"
//--------------------------------------------------------------------------------
// Program Name : åıÉZÉìÉTÅ[ééÇµ.C
//--------------------------------------------------------------------------------
void user_main(void)
{
   while (TRUE) {
      if (gAD[CN1] < 153) {
         gPwm[0] = 0x64; 
         gPwm[1] = 0x64; 
         gPwm[2] = 0x00; 
         gPwm[3] = 0x00; 
         gPwm[4] = 0x00; 
         gPwm[5] = 0x00; 
         pwm_out();
      } else {
         gPwm[0] = 0x0F; 
         gPwm[1] = 0x8F; 
         gPwm[2] = 0x0F; 
         gPwm[3] = 0x00; 
         gPwm[4] = 0x00; 
         gPwm[5] = 0x00; 
         pwm_out();
      }
   }
}
//--------------------------------------------------------------------------------
